Revit 2027 API
SpatialFieldManager.LegendPosition Property
 Stores current position of analysis results legend element in view
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LegendPosition { get; set; }
Public Property LegendPosition As XYZ
	Get
	Set
public:
property XYZ^ LegendPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LegendPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace